kireeti-ai/secure-forest-patrol/node-firmware/lib/HAL/src/Esp32SerialConsole.cpp
#include "Esp32SerialConsole.h"
#include <Arduino.h>

namespace forest::hal {

void Esp32SerialConsole::begin(unsigned long baudRate) {
    if (!Serial) {
        Serial.begin(baudRate);
    }
}

void Esp32SerialConsole::print(const char *text) {
    Serial.print(text);
}

void Esp32SerialConsole::println(const char *text) {
    Serial.println(text);
}

bool Esp32SerialConsole::readLine(char *buffer, std::size_t capacity) {
    if (buffer == nullptr || capacity < 2U) return false;
    while (Serial.available() > 0) {
        const char character = static_cast<char>(Serial.read());
        if (character == '\r') continue;
        if (character == '\n') {
            line_[length_] = '\0';
            std::size_t copyLength = length_ < capacity - 1U ? length_ : capacity - 1U;
            for (std::size_t i = 0; i < copyLength; ++i) buffer[i] = line_[i];
            buffer[copyLength] = '\0';
            length_ = 0U;
            return true;
        }
        if (length_ + 1U < sizeof(line_)) line_[length_++] = character;
    }
    return false;
}

} // namespace forest::hal

